#!/bin/bash

#-----------------------------------------------------------
# Shell 函数
# 可以带function fun() 定义，也可以直接fun() 定义,不带任何参数。
# 参数返回，可以显示加：return 返回，如果不加，将以最后一条命令运行结果，作为返回值。 return后跟数值n(0-255
#-----------------------------------------------------------
#  [ function ] funname [()]
#  {
#
#      action;
#
#      [return int;]
#
#  }
#-----------------------------------------------------------
function demoFun(){
    echo "这是我的第一个 shell 函数!"
}
echo "-----函数开始执行-----"
demoFun
echo "-----函数执行完毕-----"

#-----------------------------------------------------------
# 有return语句的函数
# 函数返回值在调用该函数后通过 $? 来获得
#-----------------------------------------------------------
funWithReturn(){
    echo "这个函数会对输入的两个数字进行相加运算..."
    echo "输入第一个数字: "
    read aNum
    echo "输入第二个数字: "
    read anotherNum
    echo "两个数字分别为 $aNum 和 $anotherNum !"
    return $(($aNum+$anotherNum))
}
funWithReturn
echo "输入的两个数字之和为 $? !"

#-----------------------------------------------------------
# 函数参数
#-----------------------------------------------------------
funWithParam(){
    echo "第一个参数为 $1 !"
    echo "第二个参数为 $2 !"
    echo "第十个参数为 ${10} !"
    echo "第十一个参数为 ${11} !"
    echo "参数总数有 $# 个!"
    echo "作为一个字符串输出所有参数 $* !"
}
funWithParam 1 2 3 4 5 6 7 8 9 34 73